Revit 2024 API
BuiltInFailures.MEPFabricationFailures.HangerProfileNotMatchWithHost Property
 The defined hanger profile does not match with the host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId HangerProfileNotMatchWithHost { get; }
Visual Basic
Public Shared ReadOnly Property HangerProfileNotMatchWithHost As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ HangerProfileNotMatchWithHost {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace